InformationRegisters/СрокиХраненияИсторииДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СрокиХраненияИсторииДанных</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокХранения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СрокиХраненияИсторииДанных/Forms/УправлениеИсториейДанных/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СрокиХранения = ПолучитьСрокиХранения();
	ОбновитьТаблицуВерсионируемыхОбъектовДерево(СрокиХранения);
	ЗаполнитьДеревоГруппВерсионируемыхОбъектов(СрокиХранения);
	ПересчитатьВыбранностьГруппыОбъектовВерсионирования(ВерсионируемыеВидыОбъектовДерево);
	ПересчитатьВыбранностьГруппыОбъектовВерсионирования(ГруппыВерсионируемыхОбъектов);
	
	ОбновитьТекстСтатусРегламентногоЗадания(Элементы.СтатусРегЗадания);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьСписокВключенныхОбъектовДоРедактирования();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСтатусРегламентногоЗадания(Команда)
	ОбновитьТекстСтатусРегламентногоЗадания(Элементы.СтатусРегЗадания);
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРегламентноеЗадание(Команда)
	ИДРегЗадание = ПолучитьИдентификаторРегЗадания();
	ОткрытьФорму("Обработка.РегламентныеИФоновыеЗадания.Форма.РегламентноеЗадание",Новый Структура("Идентификатор, Действие",ИДРегЗадание,"Изменить"))
КонецПроцедуры

&НаКлиенте
Процедура УдалитьИсториюКоманда(Команда)
	
	ТекущиеДанные = Неопределено;
	Если Команда.Имя = "УдалитьИсториюОбщийСписок" Тогда
		ТекущиеДанные = Элементы.ВерсионируемыеВидыОбъектовДерево.ТекущиеДанные;
	ИначеЕсли Команда.Имя = "УдалитьИсториюНаборыПрикладныхОбъектов" Тогда
		ТекущиеДанные = Элементы.ГруппыВерсионируемыхОбъектов.ТекущиеДанные;
	КонецЕсли;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		ТекстВопроса = "История данных для """ + ТекущиеДанные.Имя + """ будут удалены без возможности восстановления. "
						+ "Данная процедура может занять длительное время. Продолжить?";

		
		ДопПараметры = Новый Структура("ТипМетаданных, ИмяМетаданных", ТекущиеДанные.Тип, ТекущиеДанные.Имя); 
		Оповещение = Новый ОписаниеОповещения("ПродолжитьУдалитьИсториюКоманда", ЭтотОбъект, ДопПараметры);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияДанныхОткрытьФормуУдаления(Команда)
	ОткрытьФорму("РегистрСведений.СрокиХраненияИсторииДанных.Форма.ОчисткаИсторииДанных",, ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	СохранитьНастройкиИсторииДанных();
	
	// История данных
	ИзмененияИсторииДанных = ПолучитьИзмененияСоставаВерсионируемыхОбъектов();
	ЗаполнитьСписокВключенныхОбъектовДоРедактирования();
	Если ИзмененияИсторииДанных.Добавленные.Количество() + ИзмененияИсторииДанных.Удаленные.Количество() <> 0 Тогда
		ТекстВопроса = НСтр("ru='Состав объектов истории данных изменился. Перейти к очистке и первоначальному созданию версий?'");
		ТекстЗаголовка = НСтр("ru='История данных'");
		Если Вопрос(ТекстВопроса, РежимДиалогаВопрос.ОКОтмена, 30, КодВозвратаДиалога.ОК, ТекстЗаголовка) = КодВозвратаДиалога.ОК Тогда
			ПараметрыФормы = Новый Структура("ОбъектыМетаданных", ИзмененияИсторииДанных);
			ОткрытьФорму("РегистрСведений.СрокиХраненияИсторииДанных.Форма.ВыборОбъектовОбработкиВерсийИсторииДанных", ПараметрыФормы);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов 

&НаКлиенте
Процедура ВерсионируемыеВидыОбъектовДеревоВыбранПриИзменении(Элемент)
	
	ТекущаяСтрока = ВерсионируемыеВидыОбъектовДерево.НайтиПоИдентификатору(Элементы.ВерсионируемыеВидыОбъектовДерево.ТекущаяСтрока);
	Если ТекущаяСтрока.Выбран = 2 Тогда
		ТекущаяСтрока.Выбран = 0;
	КонецЕсли;			
	
	Если Элемент.Имя = "ВерсионируемыеВидыОбъектовДеревоСрокХранения" Тогда
		Если КомуИзмененыСрокиХранения.НайтиПоЗначению(ТекущаяСтрока.Имя) = Неопределено Тогда
			КомуИзмененыСрокиХранения.Добавить(ТекущаяСтрока.Имя);
		КонецЕсли;
	КонецЕсли;
	
	Если ТекущаяСтрока.ПолучитьЭлементы().Количество()>0 Тогда 
		Для Каждого ПодчиненныйЭлемент Из ТекущаяСтрока.ПолучитьЭлементы() Цикл
			ПодчиненныйЭлемент.Выбран = Булево(ТекущаяСтрока.Выбран);
			ОбработкаВыделенияОбъектаИсторииДанныхВДереве(ПодчиненныйЭлемент.Имя, ПодчиненныйЭлемент.Выбран, ПодчиненныйЭлемент.СрокХранения, ГруппыВерсионируемыхОбъектов);
		КонецЦикла;
	Иначе
		ПересчитатьВыбранностьГруппыОбъектовВерсионирования(ВерсионируемыеВидыОбъектовДерево);
		ОбработкаВыделенияОбъектаИсторииДанныхВДереве(ТекущаяСтрока.Имя, ТекущаяСтрока.Выбран, ТекущаяСтрока.СрокХранения, ГруппыВерсионируемыхОбъектов);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ГруппыВерсионируемыхОбъектовВыбранПриИзменении(Элемент)
	
	ТекущаяСтрока = ГруппыВерсионируемыхОбъектов.НайтиПоИдентификатору(Элементы.ГруппыВерсионируемыхОбъектов.ТекущаяСтрока);
	Если ТекущаяСтрока.Выбран = 2 Тогда
		ТекущаяСтрока.Выбран = 0;
	КонецЕсли;			
	
	Если Элемент.Имя = "ГруппыВерсионируемыхОбъектовСрокХранения" Тогда
		Если КомуИзмененыСрокиХранения.НайтиПоЗначению(ТекущаяСтрока.Имя) = Неопределено Тогда
			КомуИзмененыСрокиХранения.Добавить(ТекущаяСтрока.Имя);
		КонецЕсли;
	КонецЕсли;
	
	ИзмененныеОбъекты = Новый Массив;
	
	Если ТекущаяСтрока.ПолучитьЭлементы().Количество() > 0 Тогда 
		
		Для Каждого ПодчиненныйЭлемент Из ТекущаяСтрока.ПолучитьЭлементы() Цикл
			
			ПодчиненныйЭлемент.Выбран = ТекущаяСтрока.Выбран;
			ИзмененныеОбъекты.Добавить(ПодчиненныйЭлемент.Имя);
		КонецЦикла;
	Иначе
		ИзмененныеОбъекты.Добавить(ТекущаяСтрока.Имя);
	КонецЕсли;
	
	Для Каждого ИзмененныйОбъект Из ИзмененныеОбъекты Цикл
		ОбработкаВыделенияОбъектаИсторииДанныхВДереве(ИзмененныйОбъект, Булево(ТекущаяСтрока.Выбран), ТекущаяСтрока.СрокХранения, ВерсионируемыеВидыОбъектовДерево, ГруппыВерсионируемыхОбъектов);
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстСтатусРегламентногоЗадания(ЭлементНадпись)
	
	СтатусРЗ = ПолучитьСтатусРегламентногоЗаданияНаСервере();
	Если СтатусРЗ Тогда
		ТекстЗаголовка = НСтр("ru='Регламентное задание очистки включено'");
		ЦветЗаголовка = ДопСерверныеФункцииПовтИсп.ЦветСтиля("ЦветТекстаПозитивнойНадписи");
	Иначе
		ТекстЗаголовка = НСтр("ru='Регламентное задание очистки выключено'");
		ЦветЗаголовка = ДопСерверныеФункцииПовтИсп.ЦветСтиля("ЦветОтрицательногоЧисла");
	КонецЕсли;
	
	ЭлементНадпись.Заголовок = Новый ФорматированнаяСтрока(ТекстЗаголовка,,ЦветЗаголовка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтатусРегламентногоЗаданияНаСервере()
	
	РегЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.ОчисткаИсторииДанныхПоСрокуХранения);
	Возврат РегЗадание.Использование;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьИдентификаторРегЗадания()
	Возврат РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.ОчисткаИсторииДанныхПоСрокуХранения).УникальныйИдентификатор;
КонецФункции

&НаКлиенте
Процедура ПродолжитьУдалитьИсториюКоманда(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		МетаданныеДляОчистки = ОбщегоНазначенияКлиентСервер.НовыйМассив(ДопПараметры.ТипМетаданных + "." + ДопПараметры.ИмяМетаданных);
		ДлительнаяОперация = ПолучитьДлительнуюОперацию(МетаданныеДляОчистки, Неопределено, УникальныйИдентификатор);
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		
		ПараметрыОжидания.ТекстСообщения = "Очистка истории данных...";
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершениеУдалитьИсториюКоманда", ЭтотОбъект, Новый Структура("ИмяМетаданных", ДопПараметры.ИмяМетаданных));
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДлительнуюОперацию(МетаданныеДляОчистки, ДатаОчистки, УникальныйИдентификаторФормы)
	
	НаименованиеЗадания = НСтр("ru = 'Очистка истории данных'");
	ВыполняемыйМетод = "РегистрыСведений.СрокиХраненияИсторииДанных.УдалитьИсториюДанных";
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("МетаданныеДляОчистки", МетаданныеДляОчистки);
	СтруктураПараметров.Вставить("ДатаОчистки", ДатаОчистки);
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификаторФормы);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	Возврат ДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод, СтруктураПараметров, ПараметрыВыполнения);
	
КонецФункции 

&НаКлиенте
Процедура ЗавершениеУдалитьИсториюКоманда(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Если Результат.Статус = "Ошибка" Тогда
			ПоказатьПредупреждение(,Результат.КраткоеПредставлениеОшибки);
			Возврат;
		КонецЕсли;
		
		ОбщегоНазначения.СообщитьПользователю("История данных для """ + ДопПараметры.ИмяМетаданных + """ удалена");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиИсторииДанных()
	
	ПеречислениеИспользоватьИсториюДанных = Метаданные.Справочники.Банки.Реквизиты.КоррСчет.ИсторияДанных;
	ПеречислениеНеИспользоватьИсториюДанных = Метаданные.Справочники.Банки.Реквизиты.Телефоны.ИсторияДанных;
	
	ДеревоВерсий=РеквизитФормыВЗначение("ВерсионируемыеВидыОбъектовДерево");
	Для Каждого СтрокаУровня1 Из ДеревоВерсий.Строки Цикл
		Для Каждого СтрокаУровня2 Из СтрокаУровня1.Строки Цикл
			// Сравним отметку в списке с настройками и свойством в конфигураторе	
			ИсторияДанныхСервер.ПроверитьУстановитьНастройкиИсторииДанных(СтрокаУровня2);
			Если КомуИзмененыСрокиХранения.НайтиПоЗначению(СтрокаУровня2.Имя) <> Неопределено Тогда
				ЗаписатьСрокХранения(СтрокаУровня2.Тип + "." + СтрокаУровня2.Имя, СтрокаУровня2.СрокХранения);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	КомуИзмененыСрокиХранения.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуВерсионируемыхОбъектовДерево(СрокиХранения)
	
	ПеречислениеИспользоватьИсториюДанных = Метаданные.Справочники.Банки.Реквизиты.КоррСчет.ИсторияДанных;
	ПеречислениеНеИспользоватьИсториюДанных = Метаданные.Справочники.Банки.Реквизиты.Телефоны.ИсторияДанных;
	
	МассивМетаданных = Новый Массив;
	МассивМетаданных.Добавить("Документы");
	МассивМетаданных.Добавить("Справочники");
	МассивМетаданных.Добавить("Задачи");		
	МассивМетаданных.Добавить("ПланыВидовХарактеристик");
	МассивМетаданных.Добавить("РегистрыСведений");
	
	ДеревоВерсий=РеквизитФормыВЗначение("ВерсионируемыеВидыОбъектовДерево");
	
	Для Каждого ОбъектМетаданных Из МассивМетаданных Цикл 
		СтрокаВерсийУровень1 = ДеревоВерсий.Строки.Добавить();
		Если ОбъектМетаданных = "ПланыВидовХарактеристик" Тогда
			СтрокаВерсийУровень1.Представление = "Планы видов характеристик";
		ИначеЕсли ОбъектМетаданных = "РегистрыСведений" Тогда
			СтрокаВерсийУровень1.Представление = "Регистры сведений";
		Иначе
			СтрокаВерсийУровень1.Представление = ОбъектМетаданных;
		КонецЕсли;
		Для Каждого ТекущийОбъектМетаданных Из Метаданные[ОбъектМетаданных] Цикл
			
			Если НеОтображатьОбъектВДеревеИсторииДанных(ТекущийОбъектМетаданных) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ПравоДоступа("Просмотр", ТекущийОбъектМетаданных) Тогда	
				ИмяОбъектаМетаданных = ТекущийОбъектМетаданных.Синоним;
				Если ИмяОбъектаМетаданных = "" Тогда
					ИмяОбъектаМетаданных = ТекущийОбъектМетаданных.Имя;
				КонецЕсли;
				СтрокаВерсийУровень2=СтрокаВерсийУровень1.Строки.Добавить();
				СтрокаВерсийУровень2.Представление=ИмяОбъектаМетаданных;
				СтрокаВерсийУровень2.Имя=ТекущийОбъектМетаданных.Имя;
				РазделенноеПолноеИмя = СтрРазделить(ТекущийОбъектМетаданных.ПолноеИмя(), ".");
				СтрокаВерсийУровень2.Тип = РазделенноеПолноеИмя[0];
				
				// Чтение использования истории данных
				ТекущиеНастройки = ИсторияДанных.ПолучитьНастройки(ТекущийОбъектМетаданных);
				Если ТекущиеНастройки = Неопределено Тогда
					СтрокаВерсийУровень2.Выбран = ТекущийОбъектМетаданных.ИсторияДанных = ПеречислениеИспользоватьИсториюДанных;
				Иначе
					СтрокаВерсийУровень2.Выбран = ТекущиеНастройки.Использование;
				КонецЕсли;
				
				// Срок хранения
				СрокХранения = СрокиХранения.НайтиСтроки(Новый Структура("ИмяМетаданных", СтрокаВерсийУровень2.Тип + "." + СтрокаВерсийУровень2.Имя));
				Если СрокХранения.Количество() > 0 Тогда
					СтрокаВерсийУровень2.СрокХранения = СрокХранения[0].СрокХранения;
				ИначеЕсли Не СтрокаВерсийУровень2.Выбран Тогда
					СтрокаВерсийУровень2.СрокХранения = ИсторияДанныхСервер.СрокХраненияВерсийПоУмолчанию();
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоВерсий, "ВерсионируемыеВидыОбъектовДерево");

КонецПроцедуры

&НаКлиенте
Функция ПолучитьИзмененияСоставаВерсионируемыхОбъектов()
	
	Результат = Новый Структура("Добавленные, Удаленные", Новый Массив, Новый Массив);
	
	Для Каждого СтрокаВерсийУровень1 Из ВерсионируемыеВидыОбъектовДерево.ПолучитьЭлементы() Цикл
		Для Каждого СтрокаВерсийУровень2 Из СтрокаВерсийУровень1.ПолучитьЭлементы() Цикл
			
			ПолноеИмя = СтрокаВерсийУровень2.Тип + "." + СтрокаВерсийУровень2.Имя;
			
			Если СтрокаВерсийУровень2.Выбран = 0
				И ВерсионируемыеВидыОбъектовИсходныйСостав.НайтиПоЗначению(ПолноеИмя) <> Неопределено
			Тогда
				Результат.Удаленные.Добавить(ПолноеИмя);
				
			ИначеЕсли СтрокаВерсийУровень2.Выбран = 1
				И ВерсионируемыеВидыОбъектовИсходныйСостав.НайтиПоЗначению(ПолноеИмя) = Неопределено
			Тогда
				Результат.Добавленные.Добавить(ПолноеИмя);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьСписокВключенныхОбъектовДоРедактирования()
	
	ВерсионируемыеВидыОбъектовИсходныйСостав.Очистить();
	
	Для Каждого СтрокаВерсийУровень1 Из ВерсионируемыеВидыОбъектовДерево.ПолучитьЭлементы() Цикл
		Для Каждого СтрокаВерсийУровень2 Из СтрокаВерсийУровень1.ПолучитьЭлементы() Цикл
			Если СтрокаВерсийУровень2.Выбран = 1 Тогда
				ВерсионируемыеВидыОбъектовИсходныйСостав.Добавить(СтрокаВерсийУровень2.Тип + "." + СтрокаВерсийУровень2.Имя);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НеОтображатьОбъектВДеревеИсторииДанных(ОбъектМетаданных)
	
	ИмяПодсистемы = "СайтМобильноеПриложение";
	
	Если ОбщегоНазначения.ПодсистемаСуществует(ИмяПодсистемы)
		И Метаданные.Подсистемы[ИмяПодсистемы].Состав.Содержит(ОбъектМетаданных)
	Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДеревоГруппВерсионируемыхОбъектов(СрокиХранения)
	
	ДеревоГрупп = РеквизитФормыВЗначение("ГруппыВерсионируемыхОбъектов");
	ОписаниеГрупп = РегистрыСведений.СрокиХраненияИсторииДанных.ПолучитьМакет("НаборыОбъектовИсторииДанных");
	ОсновноеДерево = РеквизитФормыВЗначение("ВерсионируемыеВидыОбъектовДерево");
	
	ОбновитьОсновноеДерево = Ложь;
	
	Для Строка = 2 По ОписаниеГрупп.ВысотаТаблицы Цикл
		
		ПерваяЯчейка = ОписаниеГрупп.Область(Строка, 1);
		ВтораяЯчейка = ОписаниеГрупп.Область(Строка, 2);
		ТретьяЯчейка = ОписаниеГрупп.Область(Строка, 3);
		ПятаяЯчейка = ОписаниеГрупп.Область(Строка, 5); 
		
		Если ПустаяСтрока(ПерваяЯчейка.Текст) Тогда
			Продолжить;
		ИначеЕсли ПустаяСтрока(ВтораяЯчейка.Текст) Тогда
			СтрокаУровень1 = ДеревоГрупп.Строки.Найти(ПерваяЯчейка.Текст, "Представление");
			Если СтрокаУровень1 = Неопределено Тогда
				СтрокаУровень1 = ДеревоГрупп.Строки.Добавить();
				СтрокаУровень1.Представление = ПерваяЯчейка.Текст;
			КонецЕсли;
		Иначе
			СтрокаУровень1 = ДеревоГрупп.Строки.Найти(ПерваяЯчейка.Текст, "Представление");
			Если СтрокаУровень1 = Неопределено Тогда
				СтрокаУровень1 = ДеревоГрупп.Строки.Добавить();
				СтрокаУровень1.Представление = ПерваяЯчейка.Текст;
			КонецЕсли;

			СтрокаУровень2 = СтрокаУровень1.Строки.Добавить();
			СтрокаУровень2.Имя = ТретьяЯчейка.Текст;
			СтрокаУровень2.Тип = ВтораяЯчейка.Текст;
			СтрокаСПредставлением = ОсновноеДерево.Строки.Найти(СтрокаУровень2.Имя, "Имя", Истина);
			Если СтрокаСПредставлением <> Неопределено Тогда 
				СтрокаУровень2.Представление = СтрокаСПредставлением.Представление;
				СрокХранения = СрокиХранения.НайтиСтроки(Новый Структура("ИмяМетаданных", СтрокаУровень2.Тип + "." + СтрокаУровень2.Имя));
				Если СрокХранения.Количество() = 0 Тогда
					Если ЗначениеЗаполнено(ПятаяЯчейка.Текст) Тогда
						Срок = Число(ПятаяЯчейка.Текст);
					Иначе
						Срок = ИсторияДанныхСервер.СрокХраненияВерсийПоУмолчанию();
					КонецЕсли;
					
					СтрокаСПредставлением.СрокХранения = Срок;
					ОбновитьОсновноеДерево = Истина;
				КонецЕсли;
			Иначе
				СтрокаУровень2.Представление = НСтр("ru='В макете введен ошибочный объект метаданных'");
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоГрупп, "ГруппыВерсионируемыхОбъектов");
	
	Если ОбновитьОсновноеДерево Тогда
		ЗначениеВРеквизитФормы(ОсновноеДерево, "ВерсионируемыеВидыОбъектовДерево");
	КонецЕсли;
	
	ПроставитьПервоначальныеОтметкиГруппВерсионируемыхОбъектов();
	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ПолучитьСрокиХранения()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СрокиХраненияИсторииДанных.ИмяМетаданных КАК ИмяМетаданных,
		|	СрокиХраненияИсторииДанных.СрокХранения КАК СрокХранения
		|ИЗ
		|	РегистрСведений.СрокиХраненияИсторииДанных КАК СрокиХраненияИсторииДанных";
	
	Возврат Запрос.Выполнить().Выгрузить()
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьСрокХранения(ИмяМетаданных, СрокХранения)
	
	МЗ = РегистрыСведений.СрокиХраненияИсторииДанных.СоздатьМенеджерЗаписи();
	МЗ.ИмяМетаданных = ИмяМетаданных;
	Если СрокХранения = 0 Тогда
		МЗ.Удалить();
	Иначе
		МЗ.СрокХранения = СрокХранения;
		МЗ.Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьВыбранностьГруппыОбъектовВерсионирования(ДеревоФормы)
	
	Для Каждого СтрокаУровня1 Из ДеревоФормы.ПолучитьЭлементы() Цикл
		
		Выбран = 0;
		ЕстьВыбранные = Ложь;
		ЕстьНеВыбранные = Ложь;
		Для Каждого СтрокаУровня2 Из СтрокаУровня1.ПолучитьЭлементы() Цикл
			
			Если СтрокаУровня2.Выбран = 0 Тогда
				ЕстьНеВыбранные = Истина;
			Иначе
				ЕстьВыбранные = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЕстьВыбранные И ЕстьНеВыбранные Тогда
			СтрокаУровня1.Выбран = 2;
		ИначеЕсли ЕстьВыбранные Тогда;
			СтрокаУровня1.Выбран = 1;
		Иначе
			СтрокаУровня1.Выбран = 0;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбработкаВыделенияОбъектаИсторииДанныхВДереве(ИмяОбъектаМетаданных, Выбран, СрокХранения, ДеревоФормы, ДеревоОтветногоПересчета = Неопределено)
	
	Для Каждого СтрокаУровень1 Из ДеревоФормы.ПолучитьЭлементы() Цикл
		Для Каждого СтрокаУровень2 Из СтрокаУровень1.ПолучитьЭлементы() Цикл
			Если СтрокаУровень2.Имя = ИмяОбъектаМетаданных Тогда
				СтрокаУровень2.Выбран = Выбран;
				СтрокаУровень2.СрокХранения = СрокХранения;
				
				Если ДеревоОтветногоПересчета <> Неопределено Тогда
					ОбработкаВыделенияОбъектаИсторииДанныхВДереве(СтрокаУровень2.Имя, СтрокаУровень2.Выбран, СтрокаУровень2.СрокХранения, ДеревоОтветногоПересчета);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла; 
	КонецЦикла;
	
	ПересчитатьВыбранностьГруппыОбъектовВерсионирования(ДеревоФормы);
	
КонецПроцедуры

&НаСервере
Процедура ПроставитьПервоначальныеОтметкиГруппВерсионируемыхОбъектов()
	
	Для Каждого СтрокаУровня1 Из ВерсионируемыеВидыОбъектовДерево.ПолучитьЭлементы() Цикл
		Для Каждого СтрокаУровня2 Из СтрокаУровня1.ПолучитьЭлементы() Цикл
			ОбработкаВыделенияОбъектаИсторииДанныхВДереве(СтрокаУровня2.Имя, Число(СтрокаУровня2.Выбран), СтрокаУровня2.СрокХранения, ГруппыВерсионируемыхОбъектов);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
